W4D4/app/views/cats/show.html.erb

  <h1>Rental Requests</h1>
  <% if @cat.rental_requests.empty? %>
---
SELECT  1 AS one FROM "cat_rental_requests" WHERE "cat_rental_requests"."cat_id" = $1 LIMIT $2  [["cat_id", 21], ["LIMIT", 1]]