W5D1/a04-prep-master/skeleton/app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)
    @comment.user_id = current_user.id
    @comment.link_id = params[:link_id]

    if @comment.save
---
INSERT INTO "comments" ("body", "user_id", "link_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "a comment"], ["user_id", 147], ["link_id", 67], ["created_at", "2018-09-16 01:58:46.379407"], ["updated_at", "2018-09-16 01:58:46.379407"]]

  def destroy
    @comment = Comment.find(params[:id])
    @comment.destroy
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 24]]