W5D1/a04-prep-master/skeleton/app/controllers/links_controller.rb

  def show
    @link = Link.find_by(id: params[:id])
---
SELECT  "links".* FROM "links" WHERE "links"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]

  def create
    @link = Link.new(link_params)
    @link.user_id = current_user.id

    if @link.save
---
INSERT INTO "links" ("title", "url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "teehee"], ["url", "cats.com"], ["user_id", 80], ["created_at", "2018-09-16 01:42:04.433052"], ["updated_at", "2018-09-16 01:42:04.433052"]]
INSERT INTO "users" ("username", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def update
    @link = current_user.links.find(params[:id])
    if @link.update_attributes(link_params)
---
SELECT  "links".* FROM "links" WHERE "links"."user_id" = $1 AND "links"."id" = $2 LIMIT $3  [["user_id", 120], ["id", 48], ["LIMIT", 1]]
UPDATE "links" SET "title" = $1, "updated_at" = $2 WHERE "links"."id" = $3  [["title", "I is jill"], ["updated_at", "2018-09-16 01:48:26.846481"], ["id", 49]]